/***************************************
 *                                     *
 *  Даден е низ от десетични цифри.    *
 *  Да се определи по колко различни   *
 *  начина може да се получи 2017      *
 *  от четири от дадените цифри,       *
 *  като се разположат в същата        *
 *  последователност, както в началния *
 *  низ.                               *
 *  Решение с динамично програмиране   *
 *  Сложност O(n)                      *
 ***************************************
*/

#include <iostream>
#include <string>
using namespace std;

int main()
{ int test_count;
  cin >> test_count;

  for(int t=1; t<=test_count; t++)
  { string s;
    cin >> s;
    int n = s.size();

    long long b2=0, b20=0, b201=0, b2017=0;

    for(int i=0; i<n; i++)
    { if(s[i]=='2') b2++;
      else if(s[i]=='0') b20 = b20 + b2;
      else if(s[i]=='1') b201 = b201 + b20;
      else if(s[i]=='7') b2017 = b2017 + b201;
    }

    cout << b2017 << endl;
  }

  return 0;
}
